#Использовать 1commands
#Использовать messenger

Процедура ИсполнениеПеременной()
	
	ТекстовыйДокумент = Новый ТекстовыйДокумент;
	ТекстовыйДокумент.Прочитать("./script update to branch main.txt", КодировкаТекста.UTF8);
	ТекстДляТелеги = "";
	ОшибкаИсполнения = Ложь;
	ПропущенныеКоманды = "";
	Разделитель = "________________________";
	Для Стр = 1 По ТекстовыйДокумент.КоличествоСтрок() Цикл
		СтрокаДокумента = ТекстовыйДокумент.ПолучитьСтроку(Стр);
		Попытка
			Команда = Новый Команда;
			Команда.УстановитьСтрокуЗапуска(СтрокаДокумента);
			КодВозврата = Команда.Исполнить();
			Если НЕ КодВозврата = 0 И НЕ ОшибкаИсполнения Тогда
				ТекстДляТелеги = ТекстДляТелеги + Разделитель + Символы.ПС
					+ "<b>Команда: </b>" + СтрокаДокумента + Символы.ПС
					+ "<b>не выполнена.</b>" + Символы.ПС
					+ "<b>Код возврата: </b>" + КодВозврата + Символы.ПС
					+ "<b>Выполнение сценария остановлено!</b>" + Символы.ПС
					+ Разделитель;
				ОшибкаИсполнения = Истина;
			Иначе
				Если НЕ ОшибкаИсполнения Тогда
					ТекстДляТелеги = ТекстДляТелеги + Разделитель + Символы.ПС
						+ "<b>Команда: " + Символы.ПС
						+ СтрокаДокумента + Символы.ПС
						+ " выполнена.</b>" + Символы.ПС
						+ "Код возврата: " + КодВозврата + Символы.ПС
						+ Разделитель;
				Иначе
					ПропущенныеКоманды = ПропущенныеКоманды + Символы.ПС
						+ "<b>Команда: " + Символы.ПС
						+ СтрокаДокумента + Символы.ПС
						+ " не выполнялась.</b>" + Символы.ПС;
				КонецЕсли;
			КонецЕсли;
		Исключение
			Если НЕ ОшибкаИсполнения Тогда
				ТекстДляТелеги = ТекстДляТелеги + Разделитель + Символы.ПС
					+ "<b>Команда: " + Символы.ПС
					+ СтрокаДокумента + Символы.ПС
					+ " выполнена.</b>" + Символы.ПС
					+ "Код возврата: " + КодВозврата + Символы.ПС
					+ Разделитель;
			Иначе
				ПропущенныеКоманды = ПропущенныеКоманды + Символы.ПС
					+ "<b>Команда: " + Символы.ПС
					+ СтрокаДокумента + Символы.ПС
					+ " не выполнялась.</b>" + Символы.ПС;
			КонецЕсли;
		КонецПопытки;
	КонецЦикла;
	
	ТекстДляТелеги = ТекстДляТелеги + Символы.ПС
		+ Разделитель + Символы.ПС
		+ "<b>Пропущенные команды: </b>" + Символы.ПС
		+ ПропущенныеКоманды + Символы.ПС
		+ Разделитель;

	ТекстДляТелеги = ТекстДляТелеги + Символы.ПС
		+ Разделитель + Символы.ПС
		+ "<b>Тестовое сообщение из Github Actions в Телеграмм.</b>" + Символы.ПС
		+ Разделитель;
	Мессенджер = Новый Мессенджер();
	Массив = Новый Массив();
	Массив.Добавить("1262060645"); //Я
	Массив.Добавить("409649835"); //Аркадий
	// Массив.Добавить("5107030414"); //Миша?
	Массив.Добавить("720351624"); //Авик
	Массив.Добавить("528929888"); //Саша
	
	Мессенджер.ИнициализироватьТранспорт("telegram",
		Новый Структура("Логин", "6553478500:AAHD4R0_b2sfMto1skddOez1NWCKnFA6tCk"));
	Для Каждого ЭлементМассива Из Массив Цикл
		Мессенджер.ОтправитьСообщение("telegram", ЭлементМассива, ТекстДляТелеги, , "html");
	КонецЦикла;
	
КонецПроцедуры

ИсполнениеПеременной();
