#Использовать 1commands
#Использовать messenger

Процедура ИсполнениеПеременной()
	
	ТекстовыйДокумент = Новый ТекстовыйДокумент;
	ТекстовыйДокумент.Прочитать(".\script update to branch main.txt", КодировкаТекста.UTF8);
	ТекстДляТелеги = "";
	ОшибкаИсполнения = Ложь;
	
	Для Стр = 1 По ТекстовыйДокумент.КоличествоСтрок() - 1 Цикл
		СтрокаДокумента = ТекстовыйДокумент.ПолучитьСтроку(Стр);
		Команда = Новый Команда;
		Команда.УстановитьСтрокуЗапуска(СтрокаДокумента);
		КодВозврата = Команда.Исполнить();
		Если НЕ КодВозврата = 0 Тогда
			ТекстДляТелеги = ТекстДляТелеги + "________________________" + Символы.ПС
				+ "Команда: " + СтрокаДокумента + " не выполнена." + Символы.ПС
				+ "Код возврата: " + КодВозврата + Символы.ПС
				+ Команда.ПолучитьВывод() + Символы.ПС
				+ "Выполнение сценария остановлено!" + Символы.ПС
				+ "________________________";
			// ОшибкаИсполнения = Истина;
		Иначе
			// Если НЕ ОшибкаИсполнения Тогда
			ТекстДляТелеги = ТекстДляТелеги + "________________________" + Символы.ПС
				+ "Команда: " + СтрокаДокумента + " выполнена." + Символы.ПС
				+ "Код возврата: " + КодВозврата + Символы.ПС
				+ Команда.ПолучитьВывод() + Символы.ПС
				+ "________________________";
			// КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Мессенджер = Новый Мессенджер();
	Массив = Новый Массив();
	Массив.Добавить("1262060645"); //Я
	Массив.Добавить("409649835"); //Аркадий
	// Массив.Добавить("5107030414"); //Миша?
	// Массив.Добавить("720351624"); //Авик
	// Массив.Добавить("528929888"); //Саша
	
	Мессенджер.ИнициализироватьТранспорт("telegram", Новый Структура("Логин", "6553478500:AAHD4R0_b2sfMto1skddOez1NWCKnFA6tCk"));
	Для Каждого ЭлементМассива Из Массив Цикл
		Мессенджер.ОтправитьСообщение("telegram", ЭлементМассива, ТекстДляТелеги);
	КонецЦикла;
КонецПроцедуры

ИсполнениеПеременной();